{
  "protocol_header": {
    "name": "User Datagram Protocol (UDP)",
    "version": "",
    "description": "The User Datagram Protocol (UDP) provides a simple, connectionless, and transaction-oriented communication mechanism with minimal protocol overhead. It is used for applications that do not require reliable delivery of data streams.",
    "fields": [
      {1
        "name": "Source Port",
        "description": "An optional field indicating the port of the sending process. If meaningful, it specifies the port to which replies should be addressed in the absence of other information.",
        "size_bits": 16,
        "constraints": [
          "If unused, the value is set to zero.",
          "The field is optional but recommended for reply purposes."
        ]
      },
      {2
        "name": "Destination Port",
        "description": "Specifies the destination port within the context of the destination internet address.",
        "size_bits": 16,
        "constraints": [
          "This field must always be present and meaningful.",
          "Its interpretation depends on the destination IP address."
        ]
      },
      {3
        "name": "Length",
        "description": "Indicates the total length of the UDP datagram, including the header and data, measured in octets.",
        "size_bits": 16,
        "constraints": [
          "The minimum value of this field is 8, as the header itself is 8 octets long.",
          "The length includes both the header and the payload."
        ]
      },
      {4
        "name": "Checksum",
        "description": "A 16-bit one's complement checksum computed over a pseudo-header derived from the IP header, the UDP header, and the data. The checksum provides error detection.",
        "size_bits": 16,
        "constraints": [
          "If the computed checksum is zero, it is transmitted as all ones (0xFFFF).",
          "A transmitted checksum value of zero indicates that no checksum was generated by the sender.",
          "The checksum calculation includes padding the data to ensure it is a multiple of two octets."
        ]
      }
    ]
  }
}